Revit 2027 API
TargetRebarEdge.TargetEdgeIndex Property
 Identifies the index of the target Rebar's edge. The index is a number between 0 and centerlines.Count - 1, where centerlines are computed by suppressing hooks, cranks and fillets for the first bar in set.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int TargetEdgeIndex { get; }
Public ReadOnly Property TargetEdgeIndex As Integer
	Get
public:
property int TargetEdgeIndex {
	int get ();
}
member TargetEdgeIndex : int with get
Property Value
Int32
See Also
Reference
TargetRebarEdge Class
Autodesk.Revit.DB.Structure Namespace